import Container from '@/components/container'
import Image from 'next/image'
import React from 'react'

export default function NewsIdPage() {
  return (
    <Container className="max-w-[950px] pt-[120px] md:pt-[160px] pb-[100px]">
      <Image
        className="w-full object-cover rounded-lg aspect-[1.8/1] mb-12"
        alt="img"
        src={'/news.png'}
        title={"title"} 
        width={950}
        height={520}
      />
    <div className="w-full m-auto md:max-w-[760px]">

      <p className="text-sm font-normal leading-6 text-left flex items-center text-[#5B6871] mb-4">
      24.08.2019
        {/* {dayjs(news?.created_at).format('YYYY.MM.DD')} */}
      </p>
      <h3 className="mb-3 text-2xl font-semibold leading-[29.05px]" >
        title
      </h3>
      <p className="text-sm font-normal leading-6 text-left flex items-center text-[#5B6871] mb-4">
      Ўзбекистон Республикаси Президенти Ш.М. Мирзиёевнинг 2017 йил 7  февралдаги  Фармони  билан  2017-2021  йилларда  Ўзбекистон Республикасини  ривожлантиришнинг  бешта  устувор йўналиши  бўйича Ҳаракатлар  стратегиясининг  тасдиқланиши  мамлакатимиз  тараққиёти-нинг  сифат  жиҳатидан  янги  даврини  бошлаб  берди.  Мазкур  тарихий ҳужжат моҳиятан жаҳонда турли ўзгаришлар ва воқеа-ҳодисалар содир бўлаётган бир паллада давлат ва жамият қурилиши соҳасидаги демок-ратик  ислоҳотларни  чуқурлаштириш,  суд-ҳуқуқ,  иқтисодий,  ижтимоий соҳалар ва хавфсизликни таъминлаш бўйича бешта устувор йўналишда амалга  ошириш  механизми  аниқ  белгиланган  давлатимизнинг  ҳақиқий стратегиясига айланди.Ҳаракатлар  стратегияси  доирасида  амалга  оширилаётган  ислоҳот-лар натижасида инсон ҳуқуқлари кафолатини таъминлашга қаратилган амалий чора-тадбирлар  кучайтирилди.  Ушбу  жараёнда  қонун  устувор-лигини  таъминлаш,  қонунийликни  мустаҳкамлашда  прокуратура  орган-лари ходимларининг зиммасидаги масъулият янада ортди. Албатта, бу вазифаларнинг самарали бажарилиши прокуратура ходимларидан чуқур билим ва салоҳият талаб қилади.2017-2021  йилларда  Ўзбекистон  Республикасини  ривожлантириш-нинг  бешта  устувор  йўналиши  бўйича  Ҳаракатлар  стратегиясида белгиланган  вазифаларга  мувофиқ,  шунингдек,  прокуратура  органлари кадрларини  тайёрлаш,  қайта  тайёрлаш  ва уларнинг  малакасини оширишнинг замонавий тизимини яратиш мақсадида2018 йил 8 майда Ўзбекистон  Республикаси  Президентининг  “Прокуратура  органлари кадрларини тайёрлаш, қайта тайёрлаш ва уларнинг малакасини ошириш тизимини  тубдан  такомиллаштириш  чора-тадбирлари  тўғрисида”ги Фармони қабул  қилинди.  Мазкур  Фармон билан  ташкил  этилган  Бош прокуратура  Академиясининг  асосий  вазифалари  ва  йўналишларидан бири сифатидақонунчиликни  такомиллаштириш  ва  ягона  ҳуқуқни қўллаш амалиётини шакллантириш бўйича илмий асосланганхулоса ва тавсиялар ишлаб чиқишбелгиланган.Академия  мутлақо  янги  форматда  ва  инновациялар  асосида  фао-лият олиб борадиган замонавий таълим ва илмий-тадқиқот муассасаси сифатида  шаклланди.  Ҳуқуқий  муаммоларни  илмий  тадқиқ  этиш, фундаментал  ва  илмий-амалий  тадқиқотлар  олиб  бориш  бўйича истиқболли жараёнлар бошлаб юборилди.Академиянинг ташкил этилганига бор йўғи бир йил тўлган бўлса-да, ушбу қисқа муддат ичида Академия профессор-ўқитувчилари томонидан прокуратура  органлари  фаолиятини  илмий-методик  жиҳатдантаъмин-лаш,  қонун  устуворлигини  таъминлаш,  қонунийликни  мустаҳкамлаш, фуқароларнинг  ҳуқуқ  ва  эркинликларини,  жамият  ва  давлатнинг  қонун билан  муҳофаза  қилинадиган  манфаатларини  қўриқлаш, коррупцияга қарши  курашиш  ваҳуқуқбузарликлар  профилактикасининг  долзарб муаммолари юзасидан тизимли асосда илмий-тадқиқот ишлариамалга оширилмоқда. Халқаро  ва  идоравий  ҳамкорлик  изчил  йўлга  қўйилди,  10  га  яқин соҳавий  олий  таълим  ва  илмий  тадқиқот  муассасаларини  бирлаш-тирувчи ягона Илмий консорциум тузилди.Бир сўз билан айтганда, илмий фаолият йўналишида Академиянинг профессор-ўқитувчилари,  тингловчилари  ва  ҳар  бир  ходими  ҳамжи-ҳатликда ва бир жамоа бўлиб бор куч-ғайратини сафарбар этмоқда.Китобхонлар  ҳукмига  ҳавола  қилинаётган  ушбу  тўплам  ҳам Академиянинг  илмий  фаолият  борасидаги  саъй-ҳаракатлари  натижаси бўлиб,  унда    Давлатимиз  раҳбари  томонидан  илгари  сурилган  бешта устувор йўналашлардан бири ҳисобланган қонун устуворлигини таъмин-лаш ва суд-ҳуқуқ тизимини янада ислоҳ қилиш масаласига бағишланган мақолалар  ўрин  олган.  Унда  Академия  профессор-ўқитувчилари, тингловчилари  ва  прокуратура  ходимлари  томонидан  жамиятда  қонун устуворлигини таъминлаш, қонунийликни мустаҳкамлаш, фуқароларнинг ҳуқуқ ва эркинликларини, жамият ва давлатнинг қонун билан муҳофаза қилинадиган  манфаатларини  қўриқлаш,  коррупцияга  қарши  кураш  ва ҳуқуқбузарликлар профилактикасининг долзарб муаммолари ўрганилган, тегишли таклиф ва тавсиялар илгари сурилган.“Қонун  устуворлигини  таъминлаш  ва  суд-ҳуқуқ  тизимини  янада ислоҳ қилишнинг устувор йўналишлари” номли мазкур тўплам Академия Ҳуқуқий муаммоларни илмий-амалий ва инновацион тадқиқ қилиш ҳамда илмий  ходимларни  тайёрлаш  марказининг  туркум  нашри  сифатида анъанавий  тарзда  даврий  чоп  этиб  борилиши  кўзда  тутилган  бўлиб, профессор-ўқитувчилари,   тингловчилар,докторантлар,   мустақил изланувчилар ва соҳа ходимларининг мамлакатимизни янада ривожлан-тиришнинг  бешта  устувор  йўналишларида  белгиланган  вазифаларнинг қонунчилик  асосларини  такомиллаштириш,  илмий-амалий  тавсиялар ишлаб чиқиш каби мақсадларни амалга оширишга қаратилган.Эътиборингизга  ҳавола  этилаётган  “Қонун  устуворлигини  таъмин-лаш  ва  суд-ҳуқуқ  тизимини  янада  ислоҳ  қилишнинг  устувор  йўналиш-лари”  номли  тўпламнинг  1-жилди  илмий  жамоатчилик  томонидан  илиқ қабул қилиниши ва Сизнинг ҳам илмий мақолангиз кейинги жилдлардан муносиб жой олишига умид боғлаймиз.
      </p>
     
    </div>


  </Container>
  )
}
