import Container from '@/components/container'
import { Button } from '@nextui-org/react'
import React from 'react'

export default function ArticlesIdPage() {
  return (
    <Container className='py-[120px] md:py-[160px]'>
    <div className="w-full cursor-pointer flex items-end  justify-between bg-[#F5F5F5] dark:bg-[#001E45] dark:text-[#FFFFFF] p-10 rounded-lg mb-12">
     <div>
      <p className=" text-[24px] font-semibold leading-[29.05px] mb-3">
        ПРИОРИТЕТНЫЕ НАПРАВЛЕНИЯ ОБЕСПЕЧЕНИЯ ПРАВОПОРЯДКА И ДАЛЬНЕЙШЕЙ РЕФОРМЫ СУДЕБНОЙ СИСТЕМЫ
      </p>
      <div className="flex items-center gap-2">
        <p className="text-sm font-normal leading-6 text-left flex items-center gap-2" >
            {/* {dayjs(articles?.created_at).format('YYYY.MM.DD')} */}
            24.08.2019
            <span className="bg-black w-[6px] h-[6px] rounded-full"></span> 
            </p>
        <p className="text-[14px] font-medium leading-[24px]">
        М.Мамасиддиқов ва Л.Исоқов
        </p>
      </div>
     <Button className='w-full bg-[#323232] text-white max-w-[220px] rounded-lg mt-4' size='md'>Читать</Button>
     </div>
    {/* <SocketIcons/> */}
  </div>
 
  {false? 
        <iframe
        src={'url'}
        style={{ width: '100%', height: '100vh' }}
    />
    :
   <p className="text-[#48535B] w-full max-w-[760px] m-auto text-base font-normal leading-[26px]">
        Ш.М. Мирзиёевнинг 2017 йил 7  февралдаги  Фармони  билан  2017-2021  йилларда  Ўзбекистон Республикасини  ривожлантиришнинг  бешта  устувор йўналиши  бўйича Ҳаракатлар  стратегиясининг  тасдиқланиши  мамлакатимиз  тараққиёти-нинг  сифат  жиҳатидан  янги  даврини  бошлаб  берди.  Мазкур  тарихий ҳужжат моҳиятан жаҳонда турли ўзгаришлар ва воқеа-ҳодисалар содир бўлаётган бир паллада давлат ва жамият қурилиши соҳасидаги демок-ратик  ислоҳотларни  чуқурлаштириш,  суд-ҳуқуқ,  иқтисодий,  ижтимоий соҳалар ва хавфсизликни таъминлаш бўйича бешта устувор йўналишда амалга  ошириш  механизми  аниқ  белгиланган  давлатимизнинг  ҳақиқий стратегиясига айланди.Ҳаракатлар  стратегияси  доирасида  амалга  оширилаётган  ислоҳот-лар натижасида инсон ҳуқуқлари кафолатини таъминлашга қаратилган амалий чора-тадбирлар  кучайтирилди.  Ушбу  жараёнда  қонун  устувор-лигини  таъминлаш,  қонунийликни  мустаҳкамлашда  прокуратура  орган-лари ходимларининг зиммасидаги масъулият янада ортди. Албатта, бу вазифаларнинг самарали бажарилиши прокуратура ходимларидан чуқур билим ва салоҳият талаб қилади.2017-2021  йилларда  Ўзбекистон  Республикасини  ривожлантириш-нинг  бешта  устувор  йўналиши  бўйича  Ҳаракатлар  стратегиясида белгиланган  вазифаларга  мувофиқ,  шунингдек,  прокуратура  органлари кадрларини  тайёрлаш,  қайта  тайёрлаш  ва уларнинг  малакасини оширишнинг замонавий тизимини яратиш мақсадида2018 йил 8 майда Ўзбекистон  Республикаси  Президентининг  “Прокуратура  органлари кадрларини тайёрлаш, қайта тайёрлаш ва уларнинг малакасини ошириш тизимини  тубдан  такомиллаштириш  чора-тадбирлари  тўғрисида”ги Фармони қабул  қилинди.  Мазкур  Фармон билан  ташкил  этилган  Бош прокуратура  Академиясининг  асосий  вазифалари  ва  йўналишларидан бири сифатидақонунчиликни  такомиллаштириш  ва  ягона  ҳуқуқни қўллаш амалиётини шакллантириш бўйича илмий асосланганхулоса ва тавсиялар ишлаб чиқишбелгиланган.Академия  мутлақо  янги  форматда  ва  инновациялар  асосида  фао-лият олиб борадиган замонавий таълим ва илмий-тадқиқот муассасаси сифатида  шаклланди.  
   </p>
  }
</Container>
  )
}
